{
    "dialogues": [
        {
            "npcName": "Learn about tags and elements",
            "dialogue": [
              "Hey there! Let's look at how HTML is built—I'll walk you through it step by step.",
              "Imagine we're writing a sentence and we want part of it to stand out. Let's say: I'm emphasized.",
              "To make that text emphasized in HTML, we’ll use something called an element. Follow along!",
              "First, we start with an opening tag. Type this: <em>",
              "Next, we put our content inside the element. Let’s add the text: I’m emphasized",
              "Now we need to close the element with a closing tag. That looks like this: </em>",
              "Great! Here’s the full element together: <em>I’m emphasized</em>",
              "Take a look at this diagram—it breaks it down into the opening tag, content, and closing tag.",
              "When a browser sees this element, it emphasizes the text. Usually, it shows up in italics like this.",
              "But here’s the twist—HTML doesn’t *tell* the browser to use italics. It just says: 'This part is emphasized.'",
              "It’s up to the browser, which is a type of parser, to decide how to show that emphasis.",
              "Fun fact: if you're trying to show importance or a different tone, there are other tags like <strong> or <i> that might be more appropriate.",
              "You're doing great! This is your first step into real HTML. Let’s keep going!"
            ],
            "images": [
              null,
              null,
              null,
              "em_opening.jpeg",
              "em_content.jpeg",
              "em_closing.jpeg",
              "em_closing.jpeg",
              "em_element_diagram.png",
              null,
              null,
              "strong_element.png",
              null
            ],
            "autoProgressLines": [false, false, false, false, false, false, false, false, false, false, false, false, false],
            "requiredPreviousDialogues": []
          }
          ,
          {
            "npcName": "Nest HTML elements",
            "dialogue": [
              "Hey again! Let’s try something together. Imagine you’re packing a suitcase for a trip.",
              "You could toss everything into one big compartment—your socks, shoes, and shampoo all mixed together.",
              "But you know what happens then—it gets messy fast. Let me show you a better way.",
              "Instead, let’s pack smarter. You put your socks in a small bag, your shampoo in another, and so on. Then all those bags go into the suitcase.",
              "Now let’s bring that idea to HTML. You can actually *nest* HTML elements the same way.",
              "Let’s build an example together. First, write a `<div>` element. This is like our suitcase.",
              "Inside that `<div>`, we’ll add some `<p>` elements—like packing smaller bags. Let’s start with the first one: `<p>Paragraph 1</p>`",
              "Now add two more: `<p>Paragraph 2</p>` and `<p>Paragraph 3</p>` inside the same `<div>`.",
              "Here’s the full structure we built:",
              "see how each paragraph is packed neatly inside the parent element?",
              "When we nest elements like this, we give structure to our HTML. It’s like organizing a suitcase.",
              "And here’s a bonus: if we apply a style to the parent, like `font-weight: bold`, the child elements can inherit it automatically.",
              "That’s inheritance in action—and it all starts with nesting!"
            ],
            "images": [
              null,
              "suitcase_loose_items.png",
              null,
              "toiletries_in_bags.png",
              null,
              "nested_div.jpeg",
              "nested_p.jpeg",
              "nested_p2.jpeg",
              "nested_p2.jpeg",
              null,
              null,
              null,
              null
            ],
            "autoProgressLines": [false, false, false, false, false, false, false, false, false, false, false, false, false],
            "requiredPreviousDialogues": ["Learn about tags and elements"]
          },
          {
            "npcName": "Understand the anatomy of an HTML page",
            "dialogue": [
              "Hey! Let’s build the foundation of a real HTML page together. We'll walk through each part step by step.",
              "First up, we start with a declaration that tells the browser what kind of document it’s reading. Go ahead and write this: `<!DOCTYPE html>`",
              "Nice! Now let’s create the main container of the page—the `<html>` element. It wraps everything else. Add `<html>` and don’t forget to close it later with `</html>`.",
              "Inside the `<html>` element, we’ll add two major sections: `<head>` and `<body>`. Let’s tackle the head first.",
              "Write your `<head>` element: `<head></head>`. This is where metadata, styles, and scripts go. It’s not visible to users, but it’s super important.",
              "Now let’s add the `<body>` section right after the head: `<body></body>`. This is where the content of your web page lives—text, images, videos, you name it.",
              "Great! Here’s how the full structure looks when we put it all together:",
              "See how the `<head>` and `<body>` are both nested inside the `<html>` element? That nesting keeps everything structured properly.",
              "Most users only see what’s in the body, but everything in this structure plays an important role.",
              "You're building a strong foundation here. With this structure in place, you’re ready to start creating real web pages!"
            ],
            "images": [
              null,
              "doctype.jpeg",
              "html_tag.jpeg",
              null,
              "head_tag.jpeg",
              "body_tag.jpeg",
              "body_tag.jpeg",
              null,
              null,
              null
            ],
            "autoProgressLines": [false, false, false, false, false, false, false, false, false, false, false],
            "requiredPreviousDialogues": ["Nest HTML elements"]
          },          
          {
            "npcName": "Identify the most common HTML elements",
            "dialogue": [
              "Hey! Let’s build a basic HTML page together using some of the most common HTML elements.",
              "Think of HTML elements like spices in cooking. Some are used in nearly every dish—others only occasionally.",
              "First, let’s start with the base structure. Type this:",
              "`<!DOCTYPE html>`",
              "`<html>`",
              "`  <head>`",
              "`    <title>My First Page</title>`",
              "`  </head>`",
              "`  <body>`",
              "`  </body>`",
              "`</html>`",
              "Now let’s add a heading to the body to give the page a title. Type this inside the `<body>`: `<h1>Welcome to My Page</h1>`",
              "You’ll see this as the biggest text on the page. It helps organize sections.",
              "Next, let’s add some text. Use a paragraph tag like this: `<p>This is my first HTML paragraph.</p>`",
              "(Optional) Let’s break up the paragraph with a line break. Add `<br>` right after the word 'paragraph'.",
              "Now let’s link to another site. Type this: `<a href='https://www.example.com'>Visit Example</a>`",
              "Nice! That creates a clickable link.",
              "Sometimes you want to emphasize just a few words. For that, we’ll use the `<span>` tag. Try this:",
              "`<p>This is a <span style='color:red;'>red word</span> in a sentence.</p>`",
              "Let’s add a quote from someone. Use this:",
              "`<blockquote>This is a wise quote from a wise person.</blockquote>`",
              "Now we’ll add a horizontal line to separate content. Add: `<hr>`",
              "Let’s finish with an image. Add this line to the bottom of the body:",
              "`<img src='https://www.example.com/image.jpg' alt='Example image'>`",
              "Here’s what your complete HTML document looks like now:",
              "That’s a complete page using the most common elements! You’ve just built a full HTML document from scratch."
            ],
            "images": [
              null,
              "spices_metaphor.png",
              null,
              "doctype.jpeg",
              "html_tag.jpeg",
              "head_tag.jpeg",
              "title_tag.jpeg",
              "title_tag.jpeg",
              "html_structure_step1.jpeg",
              "html_structure_step1.jpeg",
              "html_structure_step1.jpeg",
              "h1_output.png",
              null,
              "p_output.png",
              null,
              "a_tag_output.png",
              null,
              "span_output.png",
              "blockquote_output.png",
              "hr_output.png",
              "img_output.png",
              null
            ],
            "autoProgressLines": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false],
            "requiredPreviousDialogues": ["Understand the anatomy of an HTML page"]
          }
          
    ]
}